case/test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          9;
        startFace       117;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          9;
        startFace       126;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          72;
        startFace       135;
    }
)

// ************************************************************************* //
