case/test/constant/foam.inp
elements        
3
(
    O
    N
    Ar
);

species
(
    N2
    O2
    AR
);

reactions
{

}
